Autodesk.Revit.DB.MultiReferenceAnnotationOptions.ReferencesDontMatchReferenceCategory(System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Verifies that all of the references belongs to elements which doesn't match the
reference category required by the MultiReferenceAnnotationType.
references:
The references to test.
Returns:
Returns true if the element categories of all tested references do not match the element category required by the MultiReferenceAnnotationType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.SetAdditionalReferencesToDimension(System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Sets the additional references which the dimension will witness.
Remarks:
The additional references to dimension cannot come from the same category as the MultiReferenceAnnotationType's reference category.
referencesToDimension:
The additional references which the dimension will witness.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Some references come from elements which directly match the reference category required by the MultiReferenceAnnotationType. For
those elements please use SetElementsToDimension.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020